/*
 * ===========================================
 * ruoyi-api-workflow
 * 工作流接口模块
 * ===========================================
 */

description = "ruoyi-api-workflow 工作流接口模块"

dependencies {
    // ===========================================
    // 项目内依赖
    // ===========================================

    // 核心模块
    api(project(":ruoyi-common:ruoyi-common-core"))

    // ==========================================
    // 非必需模块
    // 如果需要跟工作流同步数据则需要在对应服务内引入bus模块
    // 如果只是调用工作流api则不需要
    // ===========================================
    compileOnly(project(":ruoyi-common:ruoyi-common-bus"))
}
