/*
 * ===========================================
 * ruoyi-common-satoken
 * 权限认证服务
 * ===========================================
 */

description = "ruoyi-common-satoken 权限认证服务"

dependencies {
    // ===========================================
    // Sa-Token 核心
    // ===========================================
    api(libs.sa.token.core)

    // ===========================================
    // Sa-Token 整合 JWT
    // ===========================================
    api(libs.sa.token.jwt)

    // ===========================================
    // 项目内依赖
    // ===========================================

    // API 模块
    api(project(":ruoyi-api:ruoyi-api-system"))

    // Redis 模块
    api(project(":ruoyi-common:ruoyi-common-redis"))

    // ===========================================
    // Caffeine 本地缓存
    // ===========================================
    api("com.github.ben-manes.caffeine:caffeine")
}
