/*
 * ===========================================
 * ruoyi-common-sms
 * 短信模块
 * ===========================================
 */

description = "ruoyi-common-sms 短信模块"

dependencies {
    // ===========================================
    // 项目内依赖
    // ===========================================
    api(project(":ruoyi-common:ruoyi-common-redis"))

    // ===========================================
    // SMS4J
    // ===========================================
    api(libs.sms4j.spring.boot.starter)
}
